api/controllers/RolesController.php

    protected function findModel($id) {
        if (($model = Roles::findOne($id)) !== null) {
---
SELECT * FROM `m_roles` WHERE `id`='5'